{
  "Title": "Personal Website",
  "Tags": [
    "project"
  ],
  "Article-Type": "left",
  "Short Summary": "This thing you are on...",
  "Long Summary": [
    "A website built to share my personal projects."
  ],
  "Sidebar": [
    {
      "Header": "Note links",
      "Content": [
        "Nothing here yet!"
      ]
    },
    {
      "Header": "Blog links",
      "Content": [
        "None yet!"
      ]
    }
  ],
  "Sections": [
    {
      "Tags": [
        "col-12"
      ],
      "Content": [
        "I started looking into making a website, because I wanted a place to share my world-building. Now you might ",
        "be thinking, \"But Jessica you're using this website as a portfolio.\" And you would be right. I am ",
        "combining all of my projects into one website due to the fact I know nothing about what I am doing... and AI ",
        "noted that it would be harder to maintain multiple websites, thoughts for if I can maintain one site."
      ]
    },
    {
      "Header": "Project Goals",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "So <strong>the goal</strong> for this project would be to share my projects, both creative and technical. ",
        "The desired outcome is for there to be people to comment on my projects and a nice to have would be for ",
        "someone to use one of my worlds in a project of their own."
      ]
    },
    {
      "Header": "Technical Overview",
      "Tags": [
        "col-6 col-12-narrow"
      ],
      "Content": [
        "I started this project about Mar. 11<sup>th</sup>, the first commit of this version was on ",
        "Mar. 12<sup>th</sup>. There was a previous notion website for portfolio purposes. Jetbrains Webstrom, ",
        "Jetbrains AI, <i class=\"fa-brands fa-google\"></i> Google Gemini, <i class=\"fa-brands fa-github\"></i> ",
        "GitHub, <i class=\"fa-brands fa-js\"></i> Javascript, <i class=\"fa-brands fa-html5\"></i> HTML, ",
        "<i class=\"fa-brands fa-css\"></i> CSS, JSON, and <i class=\"fa-brands fa-font-awesome\"></i> Font Awsome is ",
        "the current list of technologies and tools I am using."
      ]
    },
    {
      "Header": "The Challenge",
      "Tags": [
        "col-6 col-12-narrow"
      ],
      "Content": [
        "There are multiple places to host a world-building project, but most of them require subscriptions or are ",
        "otherwise limited on how the projects can be laied out and what kind of projects they will host. I desired a ",
        "website to host my projects. I would like to use the site to help get a job. Without paying multiple ",
        "subsriptions for it, otherwise I would just use <a href=\"https://www.worldanvil.com/\">World Anvil</a></p>"
      ]
    },
    {
      "Header": "The Process",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "First I found a some templates I liked the look of from <a href=\"https://html5up.net/\">HTML5 UP</a>. Which ",
        "where: Arcana, Editoral, Solid State, TXT, and Zerofour. Then I started to take parts of the templates and ",
        "break them into the parts I liked. Such as the banner from Solid State, or Zerofour's style. Thankfully all ",
        "of the templates had a similar CSS setup or I would have a much harder time.\n"
      ]
    },
    {
      "Tags": [
        "col-12"
      ],
      "Content": [
        "I learned a lot about CSS and HTML from looking though and scavanging parts of the templates. When I got ",
        "stuck on something, first I would look up or add console.log to solve the problem, if that didn't work I ",
        "would go to one of the AIs. I did find that I didn't like how the AI tended to generate code, due to it ",
        "lacking an awareness of the rest of the project, yes I did try. There where points where examples the AI ",
        "would give would be a great starting point for something I was unsure of how to start.\n"
      ]
    },
    {
      "Tags": [
        "col-12"
      ],
      "Content": [
        "I found over the course of stylizing the color cadetblue, which is a muted version of my favorite color ",
        "<i class=\"fa-regular fa-face-smile-beam\"></i>. So I decided that was my accent color, something to make ",
        "things pop."
      ]
    },
    {
      "Header": "Results & Impact",
      "Tags": [
        "col-12",
        "hidden"
      ],
      "Content": [
        "I leared quite a lot on structuring javascript, and how to get both javascript and CSS to interact with ",
        "HTML, and that website (frontend, static) devlopment is simplier than I thought (I did start with ",
        "templates...). Fun fact: JSON has origins in <a href\"https://www.w3schools.com/js/js_json.asp\">Javascript ",
        "(Object Notation)</a>. Also got to expirence the process of coding and debugging with AI. ",
        "<p><b>Outcomes:</b> Highlight the positives outcomes of the project.</p>\n",
        "<p><b>Metrics and Data:</b> If possible, quantify the results with data or metrics.</p>\n",
        "<p><b>User Feedback/Testimonials:</b> Include positive feedback or testimonials from ",
        "clients or users.</p>\n",
        "<p><b>Lessons Learned:</b> Reflect on what you learned from teh project and how it has ",
        "improved your skills.</p>"
      ]
    }
  ]
}
