
{
  "Title": "Project Template",
  "Tags": [
    "project"
  ],
  "Article-Type": "left",
  "Short Summary": "This is a template to get started on projects.",
  "Long Summary": [
    "To get started clone this template then modify the title, tags, and summaries ",
    "to match the project. Actual html code sould work fine when used in here, the ",
    "code replaces the innerHTML of the article."
  ],
  "Sidebar": [
    {
      "Header": "Note links",
      "Content": [
        "Great place for placing the notes assoicated with this project!",
        "<p><a href=\"#project-note-name\">This should be a link!</a></p>"
      ]
    },
    {
      "Content": [
        "Need a section with out a header, just remove the header!"
      ]
    },
    {
      "Header": "Blog links",
      "Content": [
        "Great place for placing the the links to the blogs assoicated with this project!",
        "<p><a href=\"#project-note-name\">This should be a link!</a></p>"
      ]
    }
  ],
  "Sections": [
    {
      "Header": "Project Goals",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "The col-* tags are how you can split this into seperate sections side by side. ",
        "Use col-12 for a single section, col-6 for half sections, col-rounded(12/num) for ",
        "different splits. Use a new setion for wider spaced paragraphs.\n",
        "<p><b>Project Goals:</b> What problem was this project trying to solve? What were ",
        "the desired outcomes?</p>"
      ]
    },
    {
      "Header": "Technical Overview",
      "Tags": [
        "col-6 col-12-narrow"
      ],
      "Content": [
        "Include things like: Client/Company, Timeline/Duration, Tools & Technology, Your Role.\n",
        "<p><b>Client or Company:</b> Mention the client or company you worked with.</p>\n",
        "<p><b>Timeline/Duration:</b> Indicate the project's start and end dates or the length of ",
        "time it took.</p\n>",
        "<p><b>Your Role:</b> Clearly define your responsibilities and contributions.</p>",
        "<p><b>Tools and Technologies:</b> List the software, programming languages, frameworks or ",
        "other tools you used</p>\n"
      ]
    },
    {
      "Header": "The Challenge/Problem",
      "Tags": [
        "col-6 col-12-narrow"
      ],
      "Content": [
        "Context, Problem Statement, Research & Planning\n",
        "<p><b>Context:</b> Explain the context of the project and the challenges you faced.</p>\n",
        "<p><b>Problem Statement:</b> Clearly articculate the problem or need that the project addressed.</p>\n",
        "<p><b>Research and Planning:</b> Briefly describe any research or panning you conducted.</p>"
      ]
    },
    {
      "Header": "The Process/Solution",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "Design Process (if applicable), Development Process (if applicable), Itterations & Feedback\n",
        "<p><b>Design Process:</b> Showcase your design thinking, wireframes, mockups, or prototypes. ",
        "Explain your design decisions and rationale.</p>\n",
        "<p><b>Development Process:</b> Dscribe your development approach, any technical challenges you ",
        "overcame, and how you implemented the solution. Include code snippets (if appropraite) or links ",
        "to repositories.</p>\n",
        "<p><b>Itterations and Feedback:</b> Mention any itterations or revisions you made based on feedback.</p>"
      ]
    },
    {
      "Header": "Results & Impact",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "Outcomes, Metrics & Data, User Feedback/Testimonials, Lessons Learned\n",
        "<p><b>Outcomes:</b> Highlight the positives outcomes of the project.</p>\n",
        "<p><b>Metrics and Data:</b> If possible, quantify the results with data or metrics.</p>\n",
        "<p><b>User Feedback/Testimonials:</b> Include positive  feedback or testimonials from ",
        "clients or users.</p>\n",
        "<p><b>Lessons Learned:</b> Reflect on what you learned from teh project and how it has ",
        "improved your skills.</p>"
      ]
    }
  ]
}
