
{
  "Title": "Witch's Brew",
  "Tags": [
    "project"
  ],
  "Article-Type": "none",
  "Short Summary": "A 2D potion crafting game",
  "Long Summary": [
    "A C Possessing project created in GAM100 with a small team of three people. Where the player can create potions ",
    "to sell them. Then use the money to buy ingredients or recipes to make more potions."
  ],
  "Sections": [
    {
      "Header": "Game Trailer",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "<video controls width=\"820\">",
        "<source src=\"assets/videos/witchs-brew.mp4\" type=\"video/mp4\">",
        "Something went wrong...",
        "</video>"
      ]
    },
    {
      "Header": "Project Goals",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "This project was the start of the project courses at DigiPen. The project's goals where to 1) get us ",
        "familiar with working in a team on a game project, 2) to build a piece that can be used to showcase our ",
        "current level of skills. Our game concept was for the player to grow or buy ingredients, make a potion, sell ",
        "the potion, to buy seeds, ingredients or potion recipes. We had found that we were too short on time to ",
        "implement the plant mechanics, so that was dropped."
      ]
    },
    {
      "Header": "Technical Overview",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "Created at DigiPen Institute of Technology, on a team of three. We had one semester to work on it from Sep. ",
        "2018 to Dec. 2018. We used something known as C-processing, a DigiPen proprietary C library for graphics and ",
        "input, and Visual Studio. We built the rest of the engine ourselves. I implemented ",
        "<a href=\"https://www.fmod.com/\">fmod</a> for sounds and music, a custom form of data management, and did ",
        "most of the input management. I designed and implemented the crafting system and the saving system."
      ]
    },
    {
      "Header": "The Process",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "One of the first things I had implemented was fmod, I struggled to get the code to work due to the lack ",
        "of understanding how to read documentation at the time. After struggling with it for about a week, I ended ",
        "up asking the TA why it wasn't working. I was over complicating it, the TA managed to help me simplify how I ",
        "was going about it."
      ]
    },
    {
      "Tags": [
        "col-12"
      ],
      "Content": [
        "Another thing I struggled with on this project, was implementing a dynamic potion crafting system. I ",
        "disliked having all of the potions data scattered everywhere so I tried to create a file that the game would ",
        "read from. At the time we were supposed to avoid using other's code, nor did I learn about JSON or XML ",
        "until later. The problem was that the first potion in the game had it's name wrong. I tried may different ",
        "ways of fixing it and none of them worked. I was over a week before I asked for help, we found out that it ",
        "was due to the file encoding being UTF-8. Strict file structures and basic txt files can be difficult to ",
        "work with when loading data."
      ]
    },
    {
      "Header": "Results",
      "Tags": [
        "col-12"
      ],
      "Content": [
        "I learned that when programming file encoding matters and that sometimes the simplest solution is best."
      ]
    }
  ]
}
